w6d2/FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carlos"], ["email", "AACgarcia@gmailc.om"], ["created_at", "2020-12-29 23:23:34.975153"], ["updated_at", "2020-12-29 23:23:34.975153"]]
---
    def create
        # user = User.new(params.require(:user).permit(:name, :email))
        user = User.new(user_columns)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        user = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        user_new =  User.delete(params[:id])